EXAMP: PROC OPTIONS (MAIN);                                                     DCL A BIT (3) INIT ('10');                                                      DCL B BIT (3) INIT ('101');                                                     DCL C BIT (16);                                                                 C=B!!A;                                                                         C=SUBSTR(C,2,3);                                                                END EXAMP;                                                                      